.emacs.d/init.org
#+TITLE: Emacs configuration file
#+BABEL: :cache yes
#+PROPERTY: header-args :tangle gen-init.el

* About

Major parts of this file comes from [[https://github.com/larstvei/dot-emacs][this]] github repository by the user
[[https://github.com/larstvei][larstvei]]. I have then altered it to fit my way of working.

* Configurations
** Meta

All changes to the configuration should be done in =init.org=, *not* in
=init.el=. A file called =gen-init.el= (and its compiled version
=gen-init.elc=) will be generated the first time Emacs is started (both ignored
by git).

Emacs can't load =.org=-files directly, but =org-mode= provides functions to
extract the code blocks and write them to a file. There are multiple ways of
handling this; like suggested by [[http://emacs.stackexchange.com/questions/3143/can-i-use-org-mode-to-structure-my-emacs-or-other-el-configuration-file][this StackOverflow post]], one could just use
=org-babel-load-file=.

When this configuration is loaded for the first time, the ~gen-init.el~ is the
file that is loaded. It looks like this:

#+BEGIN_SRC emacs-lisp :tangle no
;; Note at the top of init.org file there is a line:
;; #+PROPERTY: header-args :tangle gen-init.el
;; When we tangle init.org the result will be outputted to gen-init.el

;; This line will be added automatically anyways..
(package-initialize)

;; We can't tangle without org!
(require 'org)

;; The name and path of our generated file
(setq gen-file (concat user-emacs-directory "gen-init.el"))
(setq compiled-gen-file (concat user-emacs-directory "gen-init.elc"))

;; If the generated file doesn't exist we should create it
(unless (file-exists-p compiled-gen-file)
  (progn
    ;; Open the configuration
    (find-file (concat user-emacs-directory "init.org"))
    ;; tangle it
    (org-babel-tangle)
    ;; Compile it (create gen-init.elc)
    (byte-compile-file gen-file))
  )

;; load the generated file
(load-file compiled-gen-file)
#+END_SRC

It tangles the org-file, so that =gen-init.el= is created with the actual
configuration.

There is no reason to track =gen-init.el= or =gen-init.elc= that is generated so
both these files are added to my =.gitignore= file.

I want lexical scoping for the init-file, which can be specified in the
header. The first line of the configuration is as follows:

#+BEGIN_SRC emacs-lisp
;;; -*- lexical-binding: t -*-
#+END_SRC

The =gen-init.el= should (after the first run) mirror the source blocks in the
=init.org=. We can use =C-c C-v t= to run =org-babel-tangle=, which extracts the
code blocks from the current file into a source-specific file (in this case a
=.el=-file).

To avoid doing this each time a change is made we can add a function to the
=after-save-hook= ensuring to always tangle and byte-compile the =org=-document
after changes.

#+BEGIN_SRC emacs-lisp
(defun tangle-init ()
  "If the current buffer is 'init.org' the code-blocks are
tangled, and the tangled file is compiled."
  (when (equal (file-name-nondirectory (buffer-file-name))
               "init.org")
    ;; Avoid running hooks when tangling.
    (let ((prog-mode-hook nil))
      (org-babel-tangle)
      (byte-compile-file gen-file))))

;; Add the function to after-save-hook
(add-hook 'after-save-hook 'tangle-init)
#+END_SRC

I'd like to keep a few settings private, so we load a =private.el= if it exists
after the init-file has loaded.

#+BEGIN_SRC emacs-lisp
(add-hook
 'after-init-hook
 (lambda ()
   (let ((private-file (concat user-emacs-directory "private.el")))
     (when (file-exists-p private-file)
       (load-file private-file)))))
#+END_SRC

** Packages

Managing extensions for Emacs is simplified using =package= which is
built in to Emacs 24 and newer. To load downloaded packages we need to
initialize =package=. =cl= is a library that contains many functions from
Common Lisp, and comes in handy quite often, so we want to make sure it's
loaded, along with =package=, which is obviously needed.

#+BEGIN_SRC emacs-lisp
(require 'cl)
(require 'package)
(package-initialize)
#+END_SRC

Packages can be fetched from different mirrors, [[http://melpa.milkbox.net/#/][melpa]] is the largest
archive and is well maintained.

#+BEGIN_SRC emacs-lisp
;; When behind a proxy I noticed that I couldn't connect without replacing https
;; with http. So if you get a problem try that solution (or try to find a proper
;; solution)
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/"))
(add-to-list 'package-archives '("melpa-stable" . "https://stable.melpa.org/packages/"))
(add-to-list 'package-archives '("elpa" . "https://elpa.gnu.org/packages/"))

;(add-to-list 'package-pinned-packages '(cider . "melpa-stable") t)
#+END_SRC

The configuration assumes that the packages listed below are
installed. To ensure we install missing packages if they are missing.

#+BEGIN_SRC emacs-lisp
(let* ((package--builtins nil)
       (packages
        '(auto-compile         ; automatically compile Emacs Lisp libraries
          anaconda-mode        ; Anaconda-mode for python
          ;ivy
          ;councel
          ;swiper
          company              ; Modular text completion framework
          company-anaconda     ; Anaconda (python) backend for company
          company-shell        ; Shell script backend for company
          ;diminish             ; Diminished modes from modeline
          expand-region        ; Increase selected region by semantic units
          ;focus                ; Dim color of text in surrounding sections
          idle-require         ; load elisp libraries while Emacs is idle
          git-gutter-fringe    ; Fringe version of git-gutter.el
          ;golden-ratio         ; Automatic resizing windows to golden ratio
          ;js2-mode             ; Improved JavaScript editing mode
          multiple-cursors     ; Multiple cursors for Emacs
          neotree              ; Shows the file system tree in a buffer
          nyan-mode            ; Mode that display nyan cat in mode bar
          ;olivetti             ; Minor mode for a nice writing environment
          org                  ; Outline-based notes management and organizer
          paredit              ; minor mode for editing parentheses
          ;pdf-tools            ; Emacs support library for PDF files
          ;projectile           ; Manage and navigate projects in Emacs easily
          rainbow-mode         ; Show the color of color codes in the buffer
          smartrep             ; Allow to repeat a keybinding without prefix
          smartparens          ; Mode for editing parentheses
          which-key            ; Display available keybindings in popup
          yasnippet            ; Template system for Emacs
          xcscope)))           ; Tool to find variables and functions in C
  (ignore-errors ;; This package is only relevant for Mac OS X.
    (when (memq window-system '(mac ns))
      (push 'exec-path-from-shell packages)
      (push 'reveal-in-osx-finder packages))
    (let ((packages (remove-if 'package-installed-p packages)))
      (when packages
        ;; Install uninstalled packages
        (package-refresh-contents)
        (mapc 'package-install packages)))))
#+END_SRC

** Require

Some features are not loaded by default to minimize initialization time,
so they have to be required (or loaded, if you will). =require=-calls
tends to lead to the largest bottleneck's in a configuration. =idle-require=
delays the =require=-calls to a time where Emacs is in idle. So this is great
for stuff you eventually want to load, but is not a high priority.

#+BEGIN_SRC emacs-lisp
(require 'idle-require)              ; Need in order to use idle-require

(dolist (feature
         '(auto-compile              ; auto-compile .el files
           ;jedi                     ; auto-completion for python
           ;view
           multiple-cursors          ; Multiple cursors
           ;matlab                   ; matlab-mode
           ;ob-matlab                ; org-babel matlab
           ;ox-latex                 ; the latex-exporter (from org)
           ;ox-md                    ; Markdown exporter (from org)
           ;recentf                  ; recently opened files
           ;tex-mode                 ; TeX, LaTeX, and SliTeX mode commands
           yasnippet
           xcscope
           ))
  (idle-require feature))

(require 'view)
(require 'smartrep)
(require 'smartparens-config)

(setq idle-require-idle-delay 1)
(idle-require-mode 1)
#+END_SRC

I noticed that sometimes when I set variables they are overwritten when the
package is loaded. With =with-eval-after-load= you can run code after the
package is loaded.

#+BEGIN_SRC emacs-lisp
(with-eval-after-load "multiple-cursors"
  (setq mc/always-run-for-all t))        ; Run commands for all cursors unless
                                         ; stated other in the mc-lists.el file
#+END_SRC

** Sane defaults

We can set variables to whatever value we'd like using =setq=.

#+BEGIN_SRC emacs-lisp
(setq dabbrev-case-fold-search nil       ; Make dabbrev commands case sensitive
      dabbrev-check-all-buffers t
      windmove-wrap-around t             ; Windmove wraps around
      ;auto-revert-interval 1            ; Refresh buffers fast
      custom-file (concat
		   user-emacs-directory
		   "custom_auto.el")     ; Put customization here. But don't load it!
      ;default-input-method "TeX"        ; Use TeX when toggling input method
      echo-keystrokes 0.1                ; Show keystrokes asap in minibuffer
      inhibit-startup-message t          ; No splash screen in gui (a separate buffer)
      ;initial-scratch-message nil       ; Clean scratch buffer
      ;recentf-max-saved-items 100       ; Show more recent files
      ;ring-bell-function 'ignore        ; Quiet
      ;sentence-end-double-space nil     ; No double space
      nyan-wavy-trail t                  ; Wavy rainbow in nyan-mode
)
#+END_SRC

Some variables are buffer-local, so changing them using =setq= will only
change them in a single buffer. Using =setq-default= we change the
buffer-local variable's default value.

#+BEGIN_SRC emacs-lisp
(setq-default fill-column 80                    ; Maximum line width
              truncate-lines t                  ; Don't fold lines
              indent-tabs-mode nil              ; Use spaces instead of tabs
              word-wrap t                       ; When wrapping, do it at whitespace
              ;split-width-threshold 160        ; Split verticly by default
              ;split-height-threshold nil       ; Split verticly by default
              ;auto-fill-function 'do-auto-fill ; Auto-fill-mode everywhere
)
#+END_SRC

The =load-path= specifies where Emacs should look for =.el=-files (or Emacs lisp
files). I have a directory called =site-lisp= where I keep all extensions that
have been installed manually.

#+BEGIN_SRC emacs-lisp
(let ((default-directory (concat user-emacs-directory "site-lisp/")))
  (when (file-exists-p default-directory)
    (setq load-path
          (append
           (let ((load-path (copy-sequence load-path)))
             (normal-top-level-add-subdirs-to-load-path)) load-path))))
#+END_SRC

Answering /yes/ and /no/ to each question from Emacs can be tedious, a single
/y/ or /n/ will suffice.

#+BEGIN_SRC emacs-lisp
(fset 'yes-or-no-p 'y-or-n-p)
#+END_SRC

To avoid file system clutter we put all auto saved files in a single directory.

#+BEGIN_SRC emacs-lisp
(defvar emacs-autosave-directory
  (concat user-emacs-directory "autosaves/")
  "This variable dictates where to put auto saves. It is set to a
  directory called autosaves located wherever your .emacs.d/ is
  located.")

;; Sets all files to be backed up and auto saved in a single directory.
(setq backup-directory-alist
      `((".*" . ,emacs-autosave-directory))
      auto-save-file-name-transforms
      `((".*" ,emacs-autosave-directory t)))

;(setq backup-by-copying t)
#+END_SRC

Set =utf-8= as preferred coding system.

#+BEGIN_SRC emacs-lisp
(set-language-environment "UTF-8")
#+END_SRC

** Modes

There are some modes that are enabled by default that I don't find
particularly useful. We create a list of these modes, and disable all of
these.

#+BEGIN_SRC emacs-lisp
(dolist (mode
         '(tool-bar-mode                ; No toolbars, more room for text
           menu-bar-mode                ; Remove the menu bar at the top
           blink-cursor-mode))          ; The blinking cursor gets old
  (funcall mode 0))
#+END_SRC

Let's apply the same technique for enabling modes that are disabled by
default.

#+BEGIN_SRC emacs-lisp
(dolist (mode
         '(;abbrev-mode                  ; E.g. sopl -> System.out.println
           column-number-mode           ; Show column number in mode line
           delete-selection-mode        ; Replace selected text
           ;dirtrack-mode                ; directory tracking in *shell*
           ;drag-stuff-global-mode       ; Drag stuff around
           ;global-company-mode          ; Auto-completion everywhere
           global-git-gutter-mode       ; Show changes latest commit
           ;global-prettify-symbols-mode ; Greek letters should look greek
           ;projectile-global-mode       ; Manage and navigate projects
           ;recentf-mode                 ; Recently opened files
           save-place-mode              ; Put cursor position at the position
                                        ; where is was the last time the file
                                        ; was visited
           show-paren-mode              ; Highlight matching parentheses
           which-key-mode               ; Available keybindings in popup
           smartparens-global-mode
           yas-global-mode))            ; Activate yasnippet
  (funcall mode 1))

(when (version< emacs-version "24.4")
  (eval-after-load 'auto-compile
    '((auto-compile-on-save-mode 1))))  ; compile .el files on save
#+END_SRC

